[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:32:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="ArticlesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: Articles tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticlesForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:74:43
                             type="text"
                             isInvalid={Boolean(errors.url)}
                             {...register("url", {
-                                required: "Url is required."
+                                required: ""
                             })}
                         />
killedBy: Articles tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Url is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:118:43
                             type="text"
                             isInvalid={Boolean(errors.email)}
                             {...register("email", {
-                                required: "Email of Author is required."
+                                required: ""
                             })}
                         />
killedBy: Articles tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email of Author is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:134:42
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateAdded)}
-                            {...register("dateAdded", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: Articles tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:137:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'Date Added is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: Articles tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:137:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'Date Added is required.'}
+                            {errors.dateAdded || 'Date Added is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: Articles tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
