[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/Articles/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: ArticlesTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/Articles/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:40:21
             accessor: 'title',
         },
         {
-            Header: 'Url',
+            Header: "",
             accessor: 'url',
         },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Url. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:43:9
             Header: 'Url',
             accessor: 'url',
         },
-        {
-            Header: 'Explanation',
-            accessor: 'explanation',
-        },
+        {},
         {
             Header: 'Email',
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:53:23
         },
         {
             Header: 'DateAdded',
-            accessor: 'dateAdded',
+            accessor: "",
         }
     ];
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateAdded"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
