[Killed] ObjectLiteral
main/pages/Articles/ArticlesIndexPage.js:17:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/Articles/all"],
-            { method: "GET", url: "/api/Articles/all" },
+            {},
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: ArticlesIndexPage tests renders three articles correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Articles/ArticlesIndexPage.js:17:23
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/Articles/all"],
-            { method: "GET", url: "/api/Articles/all" },
+            { method: "", url: "/api/Articles/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: ArticlesIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/Articles/all"
Received string:    "Error communicating with backend via  on /api/Articles/all"

[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/Articles/create"
-                    style={{ float: "right" }}
-                >
-                    Create Article
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
