[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:3:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ArticlesEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ArticlesEditPage() {}
 
killedBy: ArticlesEditPage tests Renders expected content
statusReason: Error: ArticlesEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
