[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:10:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/menuItemReviews/edit/${cell.row.values.id}`)
-    };
+    const editCallback = (cell) => {};
 
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuItemReviews/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:32:21
             accessor: 'reviewerEmail',
         },
         {
-            Header: 'Stars',
+            Header: "",
             accessor: 'stars',
         },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Stars. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
