[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:57:23
         },
         {
             Header: 'Done',
-            accessor: (row, _rowIndex) => String(row.done)
+            accessor: () => undefined
         },
     ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
