[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:9:31
 
 export default function RecommendationRequestCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/RecommendationRequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:22:48
     }
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(`New RecommendationRequest Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`);
-  }
+  const onSuccess = (recommendationRequest) => {}
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New RecommendationRequest Created - id: 17 requesterEmail: requestTest@ucsb.edu"

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:23:11
   });
 
   const onSuccess = (recommendationRequest) => {
-    toast(`New RecommendationRequest Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`);
+    toast(``);
   }
 
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New RecommendationRequest Created - id: 17 requesterEmail: requestTest@ucsb.edu"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:39:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/recommendationrequest" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/recommendationrequest"}

Number of calls: 0
