[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:31:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/RecommendationRequest/all"],
-      { method: "GET", url: "/api/RecommendationRequest/all" },
+      { method: "GET", url: "" },
       []
     );
killedBy: RecommendationRequestIndexPage tests renders three requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:32:7
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/RecommendationRequest/all"],
       { method: "GET", url: "/api/RecommendationRequest/all" },
-      []
+      ["Stryker was here"]
     );
 
killedBy: RecommendationRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-id" role="cell" /> instead
