[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:129:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", {
-                                required: "Comments are required.",
-                            })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
