[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/MenuItemReview/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/MenuItemReview/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:32:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Item ID',
-            accessor: 'itemId',
-        },
+        {},
         {
             Header: 'Reviewer Email',
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:33:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Item ID',
+            Header: "",
             accessor: 'itemId',
         },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Item ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:34:23
         },
         {
             Header: 'Item ID',
-            accessor: 'itemId',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:37:21
             accessor: 'itemId',
         },
         {
-            Header: 'Reviewer Email',
+            Header: "",
             accessor: 'reviewerEmail',
         },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:56:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
