[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:31
 
 export default function MenuItemReviewCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/MenuItemReview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:12:13
   const objectToAxiosParams = (menuItemReview) => ({
     url: "/api/MenuItemReview/post",
     method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    }
+    params: {}
   });
 
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "comments": "Horrible",
-   "dateReviewed": "2022-04-20T12:00",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:21:41
     }
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(`New MenuItemReview Created - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`);
-  }
+  const onSuccess = (menuItemReview) => {}
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New MenuItemReview Created - id: 1 itemId: 12"

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:22:11
   });
 
   const onSuccess = (menuItemReview) => {
-    toast(`New MenuItemReview Created - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`);
+    toast(``);
   }
 
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New MenuItemReview Created - id: 1 itemId: 12"
Received: ""

Number of calls: 1
