[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/MenuItemReview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReview Updated - id: 17 itemId: 50"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:26:10
 
 
   const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/MenuItemReview",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReview Updated - id: 17 itemId: 50"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:40:41
     }
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(`MenuItemReview Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`);
-  }
+  const onSuccess = (menuItemReview) => {}
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
         {
-          menuItemReview && <MenuItemReviewForm initialContents={menuItemReview} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.js:66:11
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
         {
-          menuItemReview && <MenuItemReviewForm initialContents={menuItemReview} submitAction={onSubmit} buttonLabel="Update" />
+          menuItemReview || <MenuItemReviewForm initialContents={menuItemReview} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: MenuItemReviewEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="MenuItemReviewForm-itemId" id="itemId" name="itemId" type="number" /> instead
