[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/MenuItemReview/create"
-                style={{ float: "right" }}
-            >
-                Create MenuItemReview 
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: reviews, error: _error, status: _status } =
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create MenuItemReview/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:14:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/MenuItemReview/create"
-                style={{ float: "right" }}
-            >
-                Create MenuItemReview 
-            </Button>
-        )
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
   
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create MenuItemReview/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:19:33
             <Button
                 variant="primary"
                 href="/MenuItemReview/create"
-                style={{ float: "right" }}
+                style={{ float: "" }}
             >
                 Create MenuItemReview 
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:31:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/MenuItemReview/all"],
-      { method: "GET", url: "/api/MenuItemReview/all" },
+      {},
       []
     );
killedBy: MenuItemReviewIndexPage tests renders three reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:31:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/MenuItemReview/all"],
-      { method: "GET", url: "/api/MenuItemReview/all" },
+      { method: "", url: "/api/MenuItemReview/all" },
       []
     );
killedBy: MenuItemReviewIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/MenuItemReview/all"
Received string:    "Error communicating with backend via  on /api/MenuItemReview/all"
